Repository: rmraya/TMXEditor
Catalog: docs/i18n/tmxeditor_fr.ditamap.xlf.tmx
Source language: en
Languages: fr

source: Check the Case Sensitive Search checkbox if you want to find only entries that match the case of the entered text.
fr: Cochez la case Respecter la casse si vous ne voulez afficher que les unités de traductions qui respectent la casse de votre critère de recherche.

source: To display untranslated units only:
fr: Pour n’afficher que les unités non traduites :

source: Check the Show Untranslated Units Only checkbox.
fr: Cochez la case Afficher uniquement les unités non traduites .

source: Use the Source Language drop-down to select the source language that will be used when filtering.
fr: À l’aide de la liste déroulante Langue source , sélectionnez la langue devant être considérée comme la langue source lors du filtrage.

source: Click the Apply Filters button.
fr: Cliquez sur le bouton Filtrer .

source: Filtering options will remain active until you reopen the Filter Units dialog and click the Clear Filters button.
fr: Seules les unités de traductions correspondant aux critères de recherche sont affichées dans la fenêtre principale. Pour afficher comme avant toutes les unités de traduction, ouvrez à nouveau la boîte de dialogue Filtrer les unités de traduction , et appuyez sur le bouton Annuler le filtrage .

source: In main menu, select View Filter Translation Units option ( [ F3 ]) or click the Filter Translation Units on the top toolbar.
fr: Dans le menu, sélectionnez Affichage Filtrez les unités de traduction (touche [ F3 ]), ou cliquez sur le bouton Filtrer les unités de traduction dans la barre d’outils.

source: Filter Translation Units Dialog
fr: Boîte de dialogue "Filtrer les unités de traduction"

source: Select what you want to filter:
fr: Définissez les critères de votre filtre :

source: To locate and highlight a given text in the TMX file:
fr: Pour afficher et mettre en surbrillances toutes les occurrences d’un texte donné :

source: Type the text that you want to find in the Text to Search text box.
fr: Saisissez le texte à rechercher dans le champ Recherche .

source: Use the Filter Language drop-down to select the language where the search will be performed.
fr: Sélectionnez la langue dans laquelle la recherche doit s’effectuer à l’aide de la liste déroulante Langue sur laquelle porte le filtre .

source: Select the Regular Expression checkbox if you want to use regular expressions for specifying the text to search.
fr: Cochez la case Expression régulière si votre critère de recherche est une expression régulière.

source: In main menu, select File Convert Excel File to TMX option or click the Convert Excel File to TMX button on the top toolbar.
fr: Dans le menu, sélectionnez Fichier Convertir un fichier Excel en TMX , ou cliquez sur le bouton Convertir un fichier Excel en TMX dans la barre d’outils.

source: Click the Set Languages button if language codes are not included in the file or you wish to change the automatically detected ones.
fr: Si les codes de langue ne sont pas présents dans la feuille de calcul, ou si vous souhaitez modifier les langues suggérées, cliquez sur le bouton Définir les langues .

source: Excel File Languages Dialog
fr: Boîte de dialogue "Langues du fichier Excel"

source: Use the drop-down selectors to associate a language to each column. Click on the Set Languages button when finished.
fr: Sélectionnez la langue correspondant à chaque colonne à l’aide des listes déroulantes. Puis, cliquez sur le bouton Enregistrer .

source: The preview panel is updated to display selected languages for each column:
fr: L’aperçu est mis à jour avec les codes de langue dans les en-têtes de colonnes.

source: Excel Preview Panel with Languages Selected
fr: Zone d’aperçu du fichier Excel avec les langues sélectionnées

source: Click the Convert Excel File to TMX button.
fr: Cliquez sur le bouton Convertir le fichier en TMX pour lancer le traitement.

source: A TMX file containing all text from the Excel document is generated in the selected location.
fr: Le fichier TMX est généré à l’emplacement défini. Il contient tout le texte de la feuille de calcul Excel.

source: Convert Excel File to TMX Dialog
fr: Boîte de dialogue "Convertir un fichier Excel en TMX"

source: Type the name of the Excel file to be converted in the Excel File text box or use the associated Browse... button to select a file from the system.
fr: Dans le champ Fichier Excel , saisissez le chemin du fichier Excel à convertir, ou sélectionnez le fichier à l’aide du bouton Parcourir .

source: A preview of the the initial ten rows of the first worksheet is automatically loaded when you use the Browse... button:
fr: Si vous avez utilisé le bouton Parcourir , les dix premières lignes de la feuille de calcul sont automatiquement chargées dans la zone d’aperçu :

source: Excel Preview Panel
fr: Zone d’aperçu du fichier Excel

source: If you typed an Excel file name on the Excel File text box, click the Refresh Preview button to generate a preview.
fr: Si vous avez saisi directement le chemin du fichier dans le champ Fichier Excel , cliquez sur le bouton Actualiser l’aperçu pour générer l’aperçu.

source: Type the name of the TMX file to generate in the TMX File text box or use the associated Browse... button to select a file name and location.
fr: Dans le champ Fichier TMX , saisissez le nom fichier TMX à générer, ou indiquez son emplacement et son nom à l’aide du bouton Parcourir .

source: Use the Sheet drop-down control to select the worksheet that you want to convert.
fr: Sélectionnez la feuille de calcul à convertir à l’aide de la liste déroulante Feuille .

source: In main menu, select File Convert SDLTM File to TMX option or click the Convert SDLTM File to TMX button on the top toolbar.
fr: Dans le menu, sélectionnez Fichier Convertir un fichier SDLTM en TMX , ou cliquez sur le bouton Convertir un fichier SDLTM en TMX dans la barre d’outils.

source: Convert SDLTM File to TMX Dialog
fr: Boîte de dialogue "Convertir un fichier SDLTM en TMX"

source: Type the name of the SDLTM file to be converted in the SDLTM File text box or use the associated Browse... button to select a file from the system.
fr: Dans le champ Fichier SDLTM , saisissez le chemin du fichier SDLTM à convertir, ou sélectionnez le fichier à l’aide du bouton Parcourir .

source: Click the Convert SDLTM File to TMX button.
fr: Cliquez sur le bouton Convertir le fichier en TMX pour lancer le traitement.

source: Selected SDLTM file is converted to TMX and automatically opened in the editor if the Open Generated TMX File checkbox is selected.
fr: Le fichier TMX est généré à l’emplacement défini. Si la case Ouvrir le fichier TMX généré est cochée, ce fichier s’ouvre dans la fenêtre principale.

source: In main menu, select File Convert TBX File to TMX option or click the Convert TBX File to TMX button on the top toolbar.
fr: Dans le menu, sélectionnez Fichier Convertir un fichier TBX en TMX , ou cliquez sur le bouton Convertir un fichier TBX en TMX dans la barre d’outils.

source: Convert TBX File to TMX Dialog
fr: Boîte de dialogue "Convertir un fichier TBX en TMX"

source: Type the name of the TBX file to be converted in the TBX File text box or use the associated Browse... button to select a file from the system.
fr: Dans le champ Fichier TBX , saisissez le chemin du fichier TBX à convertir, ou sélectionnez le fichier à l’aide du bouton Parcourir .

source: Click the Convert TBX File to TMX button.
fr: Cliquez sur le bouton Convertir le fichier en TMX pour lancer le traitement.

source: Selected TBX file is converted to TMX and automatically opened in the editor if the Open Generated TMX File checkbox is selected.
fr: Le fichier TMX est généré à l’emplacement défini. Si la case Ouvrir le fichier TMX généré est cochée, ce fichier s’ouvre dans la fenêtre principale.

source: Features
fr: Fonctions de l’application

source: With TMXEditor you can:
fr: Avec TMXEditor, vous pouvez :

source: Trim initial and trailing spaces.
fr: Supprimer les espaces à gauche et à droite.

source: Consolidate translation units when the TMX file has three or more languages.
fr: Consolider les unités de traduction dans un fichier TMX ayant plus de deux langues

source: Validate TMX files.
fr: Vérifier le format d’un fichier (validité TMX).

source: Clean invalid XML characters from a TMX file.
fr: Supprimer les caractères XML invalides d’un fichier TMX.

source: Convert to TMX format
fr: Convertir au format TMX

source: Excel files
fr: des fichiers Excel

source: CSV or TAB delimited files
fr: des fichiers CSV ou TSV (séparateur Tab)

source: SDLTM files
fr: des fichiers SDLTM

source: TBX (TermBase eXchange) files
fr: des fichiers TBX (TermBase eXchange)

source: Export TMX files as
fr: Exporter un fichier TMX en

source: Set attributes, properties and notes at file level
fr: Définir des attributs, propriétés et notes au niveau du fichier.

source: TAB Delimited files
fr: fichier TSV (séparateur Tab)

source: Edit segments of your TMX file to correct errors.
fr: Éditer les segments du fichier TMX pour corriger des erreurs.

source: Merge & split TMX files.
fr: Découper et fusionner des fichiers TMX.

source: Add and remove languages from a TMX file.
fr: Ajouter ou supprimer une langue dans un fichier TMX.

source: Change languages in a TMX file.
fr: Modifier une langue dans un fichier TMX.

source: Remove duplicates.
fr: Supprimer les doublons.

source: Remove untranslated units.
fr: Supprimer les unités non traduites.

source: Remove inline tags.
fr: Supprimer les balises inline.

source: Follow these steps to convert a CSV or TAB delimited file to TMX.
fr: Marche à suivre pour convertir un fichier CSV ou TSV (séparateur Tab) en une feuille Excel.

source: Convert CSV File to TMX Dialog
fr: Boîte de dialogue "Convertir un fichier CSV ou TSV en TMX"

source: Type the name of the file to be converted in the CSV File text box or use the associated Browse... button to select a file from the system.
fr: Dans le champ Fichier CSV/TSV , saisissez le chemin du fichier à convertir, ou sélectionnez le fichier à l’aide du bouton Parcourir .

source: Use the Character Set , Column Separator and Text Delimiter drop-down boxes to define the format of the file to be converted. Use the preview panel to check the correctness of the selected settings. Use Custom Separator and Custom Delimiter text boxes to enter values not included in the drop-down selectors.
fr: Effectuez les réglages de format à l’aide des listes déroulantes Jeu de caractères , Séparateur de colonnes et Délimiteur de texte . Vérifiez que vos réglages sont corrects à l’aide de l’aperçu. Au besoin, personnalisez les réglages en saisissant les valeurs adéquates dans les champs Autre séparateur et Autre délimiteur .

source: On success, the preview panel displays the data in a tabular format. If language codes are included in the first row of the CSV file, they will be automatically detected and will also be displayed highlighted in the panel, as shown in this picture:
fr: Les données de votre fichier devraient apparaître sous forme tabulaire dans la zone d’aperçu. Si les codes de langues sont indiqués dans la première ligne de votre fichier et qu’ils sont correctement reconnus, ils apparaissent dans l’en-tête des colonnes dans l’aperçu, comme sur l’image ci-dessous :

source: Correct Settings Example
fr: Zone d’aperçu lorsque les réglages sont corrects

source: Unexpected characters, like the ones shown in the picture below, indicate wrong character set selection.
fr: Si des caractères illisibles apparaissent comme sur l’image ci-dessous, c’est probablement que le jeu de caractère est incorrect.

source: Wrong Character Set Example
fr: Zone d’aperçu lorsque le jeu de caractères est mal réglé

source: Readable text that is not displayed as a table, is a sign of incorrect selection of column separator or text delimiter. Use the preview panel to check the correct values.
fr: Si le texte est lisible mais ne s’affiche pas sous forme de tableau, c’est probablement que le séparateur de colonnes ou le délimiteur de texte est incorrect. Utilisez l’aperçu pour ajuster les réglages.

source: CSV (Comma Separated Values) are plain text files that contain text organized in tabular format, using commas to separate columns and quotes to delimit column content.
fr: Les fichiers CSV (Comma-Separated Values) sont des fichiers texte brut contenant des données tabulaires. La virgule est utilisée comme séparateur de colonnes, et les valeurs sont entre guillemets.

source: Wrong Delimiters Example
fr: Zone d’aperçu lorsque le séparateur de colonne est incorrect

source: CSV/Text Languages Dialog
fr: Boîte de dialogue "Langues du fichier CSV ou TSV"

source: Use the drop-down controls in the CSV/Text Languages dialog to select the languages in the CSV file. Click the Set Languages button to confirm your selection.
fr: Dans la boîte de dialogue Langues du fichier CSV ou TSV , sélectionnez la langue pour chacune des colonnes du fichier à convertir. Puis, cliquez sur Enregistrer .

source: Check the Fix Excel Double Quotes box if the file was exported by Excel using double quote characters as text delimiter. This option ensures that quotes are not duplicated during conversion.
fr: Si le fichier a été exporté à partir d’Excel avec des guillemets doubles comme délimiteur de texte, cochez la case Corriger les guillemets doubles d’Excel . Cela évitera que les guillemets soient dupliqués durant la conversion.

source: Check the Optional Text Delimiters box if the file does not use the selected text delimiter in all cases (some tools only surround text in delimiters when the de column separator is part of the exported text).
fr: Si le délimiteur de texte n’est pas systématiquement présent, cochez la case Tolérer les délimiteurs de texte manquants . (Certains outils ne délimitent le texte qui s’il contient le caractère du séparateur de colonne.)

source: Finally, click the Convert CSV to TMX button to generate the TMX file.
fr: Enfin, cliquez sur le bouton Convertir le fichier en TMX pour lancer le traitement.

source: The CSV file is converted to TMX and automatically opened in the editor if the Open Generated TMX File checkbox is selected.
fr: Le fichier TMX est généré à l’emplacement défini. Si la case Ouvrir le fichier TMX généré est cochée, ce fichier s’ouvre dans la fenêtre principale.

source: TAB delimited files are similar to CSV, but using TAB characters to separate columns and usually without column delimiters.
fr: Les fichiers TSV (Tab-Separated Values) sont similaires aux fichiers CSV, sauf que le séparateur de colonnes est le caractère Tab et qu’il n’y a pas de guillemets en général.

source: TMXEditor allows conversion to TMX of text files with different combinations of column separators and text delimiters.
fr: TMXEditor permet de convertir ces types de fichiers en fichiers TMX. Plusieurs séparateurs de colonne et délimiteurs de texte sont pris en charge.

source: Text files exported from Microsoft Excel use these default settings:
fr: Par défaut, Microsoft Excel applique les réglages suivants lors de l’export :

source: Character Set: UTF-16LE
fr: Jeu de caractères : UTF-16LE

source: Column Separator: TAB
fr: Séparateur de colonnes : Tab

source: Text Delimiter: none
fr: Délimiteur de texte : aucun

source: In main menu, select File Convert CSV/TAB Delimited File to TMX option or click the Convert CSV to TMX button on the top toolbar.
fr: Dans le menu, sélectionnez Fichier Convertir un fichier CSV ou TSV en TMX , ou cliquez sur le bouton Convertir un fichier CSV ou TSV en TMX dans la barre d’outils.

source: Maintenance Dashboard
fr: Effectuer plusieurs tâches en une seule passe à l’aide du tableau de bord de maintenance

source: Follow these steps to optimize a TMX file using a simplified dialog.
fr: Marche à suivre pour optimiser un fichier TMX en une seule passe.

source: Remove Untranslated Units : remove all untranslated units.
fr: Supprimer les unités non traduites , pour retirer les unités de traduction non traduites.

source: Remove Initial/Trailing Spaces : remove spaces at the start and end of all language entries.
fr: Supprimer les espaces à gauche et à droite , pour enlever tous les espaces qui se trouvent au début ou à la fin des segments.

source: Consolidate Units : merge translation units that share a common source language entry.
fr: Consolider les unités de traduction , pour fusionner les unités de traductions issues du même segment source.

source: If you selected Remove Untranslated Units or Consolidate Units , select the source language of the TMX file using the Source Language drop-down.
fr: Si vous avez sélectionné la tâche Supprimer les unités non traduites ou la tâche Consolider les unités de traduction , sélectionnez également la langue source à l’aide de la liste déroulante Langue source .

source: Click the Perform Maintenance button.
fr: Cliquez sur le bouton Exécuter la maintenance .

source: A maintenance process is started and an indicator is displayed on screen while all selected tasks are performed.
fr: Un indicateur permet de suivre la progression du traitement des différentes tâches sélectionnées.

source: In main menu, select Tasks Maintenance Dashboard or click the Maintenance Dashboard button on the top toolbar.
fr: Dans le menu, sélectionnez Tâches Tableau de bord de maintenance , ou cliquez sur le bouton Tableau de bord de maintenance dans la barre d’outils.

source: Maintenance Dashboard Dialog
fr: Boîte de dialogue "Tableau de bord de maintenance"

source: Select the corresponding checkboxes for all tasks that you want to perform:
fr: Sélectionnez les tâches à effectuer sur le fichier en cochant les cases correspondantes :

source: Remove All Tags : remove all inline tags from the TMX file.
fr: Supprimer toutes les balises , pour enlever toutes les balises inline du fichier.

source: Remove Duplicated Unis : remove duplicated translation units.
fr: Supprimer les unités en doublon , pour retirer les unités de traduction dupliquées.

source: Merge TMX Files
fr: Fusionner des fichiers TMX

source: Follow these steps to merge the content of two or more TMX files into a larger one.
fr: Voici les étapes à suivre pour fusionner plusieurs fichiers TMX en un seul gros fichier.

source: Click the Merge TMX Files button.
fr: Cliquez sur le bouton Fusionner les fichiers .

source: A progress dialog is displayed while a TMX file containing data from all selected files is created in the indicated location.
fr: Un petit message s’affiche pendant le traitement. Le fichier TMX résultat est généré à l’emplacement défini. Il contient les données de tous les fichiers de la liste.

source: In main menu, select File Merge TMX Files... .
fr: Dans le menu, sélectionnez Fichier Fusionner des fichiers TMX .

source: Merge TMX Files Dialog
fr: Boîte de dialogue "Fusionner des fichiers TMX"

source: Enter the name of the file that will contain all merged data in the Merged TMX File text box or click the Browse... button to select a file from the file system.
fr: Dans le champ Fichier TMX résultat , saisissez le chemin du gros fichier à générer, ou sélectionnez le fichier à l’aide du bouton Parcourir .

source: Use the Add Files button to select the files to be merged from the file system.
fr: Sélectionner les fichiers TMX à fusionner à l’aide du bouton Ajouter des fichiers .

source: The dialog shows added files:
fr: Voici à quoi ressemble la boîte de dialogue une fois que des fichiers ont été ajoutés :

source: If you want to remove files from the list, click the corresponding Remove File buttons ( ) on the leftmost column.
fr: Pour enlever un fichier de la liste, cliquez sur le bouton Retirer le fichier en regard du fichier à retirer.

source: Program Settings
fr: Paramètres du programme

source: Open the preferences dialog:
fr: Pour ouvrir la boîte de dialogue des préférences utilisateur :

source: Light : Uses light grey background with dark text.
fr: Clair : texte noir sur fond gris clair.

source: High Contrast : Dark theme with enhanced contrast.
fr: Contraste élevé : sombre avec un contraste renforcé.

source: Select the number of spaces used to indent XML elements in the TMX file using the Indentation selector.
fr: Concernant le formatage des fichiers TMX, réglez la largeur du retrait des balises XML imbriquées en saisissant dans le champ Indentation le nombre d’espaces à insérer.

source: Note : Indentation helps in visually understanding the structure of an XML file when viewing it as plain text but is not required for processing TMX files with translation tools.
fr: Remarque : L’indentation aide visuellement à comprendre la structure des fichiers XML lorsqu’on les ouvre dans un éditeur de texte. Elle n’a par contre aucun effet sur les traitements des fichiers TMX effectués par les outils de traduction.

source: Select the Set 'changeid' / 'changedate' Attributes checkbox if you want to enable the registration of the user who last modified an item or file and the date the change was made.
fr: Cochez la case Mettre à jour les attributs changeid et changedate si vous souhaitez activer l’enregistrement du nom de l’utilisateur ayant effectué la dernière modification d’un élément ou d’un fichier, ainsi que la date de cette modification.

source: Click the Save Preferences button to save and activate selected settings.
fr: Cliquez sur le bouton Enregistrer les préférences pour enregistrer et activer les nouveaux paramètres.

source: Theme changes are applied immediately. Changing the application language requires a restart. Indentation is applied the next time a file is saved.
fr: Les changements de thème sont appliqués immédiatement. Les changements de langue sont pris en compte au prochain redémarrage de TMXEditor. Les paramètres concernant l’utilisation de la mémoire sont appliqués à la prochaine ouverture d’un fichier TMX. Le paramètre d’indentation est appliqué au prochain fichier TMX qu’on enregistre.

source: On Windows or Linux menu, select Settings Preferences .
fr: Sur Windows ou Linux, sélectionnez Paramètres Préférences utilisateur dans le menu.

source: Use the Application Language drop-down to select the language used in TMXEditor graphical user interface.
fr: Sélectionnez la langue de l’interface graphique de TMXEditor à l’aide de la liste déroulante Langue de l’application .

source: Changes to the application language will take effect after you restart the program.
fr: Le changement de langue deviendra effectif au prochain redémarrage du programme.

source: Use the Theme drop-down to select the colors used in the graphical user interface. Available options are:
fr: Sélectionnez le jeu de couleur de l’interface graphique à l’aide de la liste déroulante Thème . Les quatre thèmes disponibles sont les suivants :

source: System Default : automatically selects Dark or Light colors according to the preferences set in the operating system.
fr: Automatique : sombre ou clair selon ce qui a été défini au niveau du système d’exploitation.

source: Dark : Uses dark background with white text.
fr: Sombre : texte blanc sur fond gris foncé.

source: Remove Duplicated Units
fr: Supprimer les unités en doublon

source: Follow these steps to remove duplicated entries in a TMX file.
fr: Marche à suivre pour supprimer les unités de traduction en doublon dans un fichier TMX.

source: Duplicated translation units increase the size of a TMX file and slow down TM searches.
fr: Les unités de traduction en doublon sont gênantes car elles augmentent inutilement la taille des fichiers TMX et ralentissent les systèmes à mémoire de traduction dans leurs recherches.

source: In main menu, select Tasks Remove Duplicated Units .
fr: Dans le menu, sélectionnez Tâches Supprimer les unités en doublon .
